app/views/users/show.html.erb

SELECT "events".* FROM "events"
---
<ul>
  <% @user.birthday_events.each do |e|%>