app/views/users/visitor_profile.html.erb

SELECT "events".* FROM "events"
---
<ul>
  <% @user.hosted_events.each do |e|%>