app/views/events/attendants.html.erb

<h1 class="text-center">All Attendants</h1>
<%if @event.attendants.count == 0%>
---
SELECT "attendants".* FROM "attendants" WHERE "attendants"."event_id" = ?  [["event_id", 1]]
SELECT COUNT(*) FROM "attendants" WHERE "attendants"."event_id" = ?  [["event_id", 1]]