app/views/events/edit.html.erb

SELECT "categories".* FROM "categories"
---
  <%= f.label :category %>
  <%= f.collection_select :category_id, Category.all, :id, :name%>

SELECT "users".* FROM "users"
---
  <%= f.label :user %>
  <%= f.collection_select :user_id, User.all, :id, :to_s%>