app/views/events/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  [["event_id", 6]]
SELECT "users".* FROM "users"
---
  <%= label_tag :user %>
  <%= collection_select :comment, :user_id, User.all, :id, :to_s%>