app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @event = Event.find(params[:id])
    @comment.event_id = @event.id
    @comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "created_at", "updated_at", "event_id") VALUES (?, ?, ?, ?, ?)  [["content", "cool"], ["user_id", 1], ["created_at", "2017-12-06 15:14:17.830870"], ["updated_at", "2017-12-06 15:14:17.830870"], ["event_id", 6]]