app/controllers/events_controller.rb

  def create
      @user = User.find(session[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def user_attend
      @user = current_user
      @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]