app/controllers/events_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Art"], ["created_at", "2017-12-05 22:33:26.498731"], ["updated_at", "2017-12-05 22:33:26.498731"]]
INSERT INTO "events" ("name", "description", "date", "age", "capacity", "user_id", "category_id", "created_at", "updated_at", "price", "location") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("first_name", "last_name", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Tashawn"], ["last_name", "Williams"], ["birthday", "1990-03-31"], ["created_at", "2017-12-06 20:30:32.860031"], ["updated_at", "2017-12-06 20:30:32.860031"]]
---
  def create
    @start_hour = params[:event]["date(4i)"].to_i
    @start_min = params[:event]["date(5i)"].to_i
    @month = params[:event]["date(2i)"].to_i
    @day = params[:event]["date(3i)"].to_i
    @year = params[:event]["date(1i)"].to_i
    @date = DateTime.new(@year,@month,@day,@start_hour,@start_min)
    @event = Event.create(name:params[:event][:name], description: params[:event][:description], price: params[:event][:price], category_id: params[:event][:category_id], user_id: params[:event][:user_id], date: @date, location:params[:event][:location], age: params[:age], capacity: params[:event][:capacity])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def attendants
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "events" SET "name" = ?, "price" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["name", "Cool event"], ["price", "$100"], ["updated_at", "2017-12-05 23:52:10.582512"], ["id", 6]]
---
  def update
    # byebug
    @start_hour = params[:event]["date(4i)"].to_i
    @start_min = params[:event]["date(5i)"].to_i
    @month = params[:event]["date(2i)"].to_i
    @day = params[:event]["date(3i)"].to_i
    @year = params[:event]["date(1i)"].to_i
    @date = DateTime.new(@year,@month,@day,@start_hour,@start_min)
    @event = Event.find(params[:id])
    @event = Event.update(name:params[:event][:name], description: params[:event][:description], price: params[:event][:price], category_id: params[:event][:category_id], user_id: params[:event][:user_id], date: @date, location:params[:event][:location])