app/controllers/users_controller.rb

  def create
      @user = User.new(user_params)
      @month = params[:user]["birthday(2i)"]
      @day = params[:user]["birthday(3i)"]
      @year = params[:user]["birthday(1i)"]
      @b_day = "#{@year}-#{@month}-#{@day}".to_date
      @user.birthday = @b_day
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "birthdate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Tashawn"], ["last_name", "Williams"], ["birthdate", "1990-12-05 00:00:00"], ["created_at", "2017-12-05 17:52:15.521226"], ["updated_at", "2017-12-05 17:52:15.521226"]]

  def show
    if logged_in? && current_user.id == params[:id].to_i
         @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def visitor_profile
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
      if logged_in? && current_user.id == params[:id].to_i
        @user = User.find(params[:id])
        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "birthday" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["birthday", "2011-08-09"], ["updated_at", "2017-12-05 20:26:04.097750"], ["id", 7]]

    def destroy
        if logged_in? && current_user.id == params[:id].to_i
          @user = User.find(params[:id])
          @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]

  def favorite
      @user = current_user
      @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]