app/views/categories/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."category_id" = ?  [["category_id", 1]]
---
<ul>
  <% @category.events.each do |event| %>